УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/CommonModules/ПодборТоваровВызовСервера/Module.bsl
#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ЦенаПродажиИОстаткиТовара")
Функция смарт_ЦенаПродажиИОстаткиТовара(Номенклатура, Характеристика, Соглашение, Валюта, Склады, ВидыЦен)
	
	Перем СоставРазделовЗапроса;
	
	Запрос = Новый Запрос;
	ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ИспользованиеХарактеристик");
	НесколькоХарактеристик = ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;

	Запрос.Текст = ОбеспечениеСервер.ТекстЗапросаДоступныхОстатковПоДатамДляПодбора(
		ЗначениеЗаполнено(Характеристика), НесколькоХарактеристик, СоставРазделовЗапроса)
		+ ПодборТоваровСервер.РазделительПакетаЗапросов()
		+ ПодборТоваровСервер.ТекстЗапросаЦенаПродажиТовара(СоставРазделовЗапроса);
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{(Номенклатура)}", "И Номенклатура = &Номенклатура И Характеристика = &Характеристика");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{(Номенклатура)}", "И Номенклатура = &Номенклатура");
		Характеристика =  Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("ВидыЦен", ВидыЦен);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДатаСеанса()));
	
	УстановитьПривилегированныйРежим(Истина);
	
	#Вставка
    
    //++ смарт:Подкин #1099 18.07.2022 15:23:10  
    //Добавление в запрос вывода доп колонки Резерв
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"- Т.ВРезервеПодЗаказ КАК Свободно","- Т.ВРезервеПодЗаказ КАК Свободно,
    | Т.ВРезервеСоСклада+ Т.ВРезервеПодЗаказ КАК Резерв");
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"Т.Количество          КАК Свободно","Т.Количество          КАК Свободно,
    | 0 КАК Резерв");
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"СУММА(Свободно)       КАК Свободно","СУММА(Свободно)       КАК Свободно,
    | СУММА(Резерв)       КАК Резерв");   
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"Т.ВНаличииВБазовыхЕдиницах КАК ВНаличииВБазовыхЕдиницах,","Т.ВНаличииВБазовыхЕдиницах КАК ВНаличииВБазовыхЕдиницах,
    | 0 КАК РезервОплачен,");
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"0                     КАК ВНаличииВБазовыхЕдиницах,","0                     КАК ВНаличииВБазовыхЕдиницах,
    | 0 КАК РезервОплачен,");
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"И Т.Номенклатура = &Номенклатура) КАК Т", "И Т.Номенклатура = &Номенклатура
    |
    | ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ТоварыКОтгрузкеОстатки.Склад,
    |	ТоварыКОтгрузкеОстатки.Склад.Наименование,
    |	0,
    |	0,
    |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0),
    |	NULL,
    |	0
    |ИЗ
    |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
    |			,
    |			Номенклатура = &Номенклатура
    |				И Склад в (&Склады)) КАК ТоварыКОтгрузкеОстатки
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
    |		ПО ТоварыКОтгрузкеОстатки.ДокументОтгрузки = СостоянияЗаказовКлиентов.Заказ
    |			ГДЕ (СостоянияЗаказовКлиентов.СуммаОплаты > 0) ) КАК Т");  
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"СУММА(Т.ВНаличииВБазовыхЕдиницах) КАК ВНаличииВБазовыхЕдиницах,","СУММА(Т.ВНаличииВБазовыхЕдиницах) КАК ВНаличииВБазовыхЕдиницах,
    | СУММА(Т.РезервОплачен) КАК РезервОплачен,
    |"); 
    
    //++ #1964 смарт: Лопато 17.09.2024 //Корректное отображения остатков товаров в помощнике по продажам, при подборе товаров  
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Т.Дата >= ПредыдущиеДни.Дата",
    										 "И Т.Дата >= ПредыдущиеДни.Дата
    										 |И Т.Характеристика = ПредыдущиеДни.Характеристика");

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "- ОстаткиСклада.ВРезервеПодЗаказ, 0)) КАК Доступно",
    									 	 "- ОстаткиСклада.ВРезервеПодЗаказ, 0)) КАК Доступно,
    										 |	СУММА(ЕСТЬNULL(ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток, 0)) КАК Резерв");    
    //-- #1964 смарт: Лопато 17.09.2024  
	
	//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"СУММА(ЕСТЬNULL(ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток, 0)) КАК Резерв",
		"СУММА(ЕСТЬNULL(ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток, 0)) КАК Резерв,
		|	СУММА(Т.Количество) КАК ДоступноНаДату");
	//-- #Б-1022 смарт: Мосолов 30.10.2024 

	Если СтрНайти(Запрос.Текст,"ВтПриростДоступностиПоХарактеристике") Тогда
        Запрос.Текст=СтрЗаменить(Запрос.Текст," И Т.Характеристика = ОстаткиСклада.Характеристика",
        " И Т.Характеристика = ОстаткиСклада.Характеристика 
        |ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(
        |		,
        |		Склад В (&Склады)
        |			И Номенклатура = &Номенклатура) КАК ГрафикОтгрузкиТоваровОстатки
        |ПО (Т.Склад = ГрафикОтгрузкиТоваровОстатки.Склад)
        |	И (Т.Характеристика = ГрафикОтгрузкиТоваровОстатки.Характеристика)
        |	И (Т.Дата = ГрафикОтгрузкиТоваровОстатки.ДатаОтгрузки)");    
    Иначе   
        Запрос.Текст=СтрЗаменить(Запрос.Текст," И Т.Характеристика = ОстаткиСклада.Характеристика",
        " И Т.Характеристика = ОстаткиСклада.Характеристика 
        |ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(
        |		,
        |		Склад В (&Склады)
        |			И Номенклатура = &Номенклатура) КАК ГрафикОтгрузкиТоваровОстатки
        |ПО (Т.Склад = ГрафикОтгрузкиТоваровОстатки.Склад)
        |	И (Т.Характеристика = ГрафикОтгрузкиТоваровОстатки.Характеристика)
        |	И (Т.ДатаДоступности = ГрафикОтгрузкиТоваровОстатки.ДатаОтгрузки)");    
    КонецЕсли;
    
      //-- смарт:Подкин #1099 18.07.2022 15:23:10	     
    
	#КонецВставки
	Результат = Запрос.ВыполнитьПакет();
	
	// Цена продажи.
	Коэффициент = 1;
	
	ЦенаПродажи = Новый Структура("ВидЦены, Цена, Упаковка, ЕдиницаИзмерения, Описание, СрокПоставки");
	
	ЦенаПродажи.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	ЦенаПродажи.Цена = 0;
	ЦенаПродажи.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ЦенаПродажи.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ЦенаПродажи.Описание = "";
	ЦенаПродажи.СрокПоставки = '00010101';
	
	Выборка = Результат[СоставРазделовЗапроса.Найти("ЦенаПродажиТовара")].Выбрать();
	Если Выборка.Следующий() Тогда
		
		Коэффициент = Выборка.Коэффициент;
		ЗаполнитьЗначенияСвойств(ЦенаПродажи, Выборка);
		
	КонецЕсли;
	
	// Планируемые остатки.
	Выборка = Результат[СоставРазделовЗапроса.Найти("ПланируемыеОстатки")].Выбрать();
	ПланируемыеОстатки = Новый Массив;
	
	#Вставка   
	//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками
	ТаблицаПоступленийНаДату = Результат[СоставРазделовЗапроса.Найти("ПланируемыеОстаткиНаДату")].Выгрузить(); 
	//-- #Б-1022 смарт: Мосолов 30.10.2024 
	#КонецВставки

	Пока Выборка.Следующий() Цикл    
		
		#Удаление
		НоваяСтрока = Новый Структура("Склад, Период, Доступно");
		#КонецУдаления
		#Вставка
        //++ смарт:Подкин #1099 24.07.2022 14:49:10
		//НоваяСтрока = Новый Структура("Склад, Период, Доступно"); 
        НоваяСтрока = Новый Структура("Склад, Период, Доступно, Резерв, РезервОплачен"); 
        //-- смарт:Подкин #1099 24.07.2022 14:49:10
		#КонецВставки
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		
		#Удаление
		НоваяСтрока.Доступно = НоваяСтрока.Доступно / Коэффициент; 
		#КонецУдаления
		
		#Вставка   
		//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Склад", Выборка.Склад); 
		
		СтрокиТаблицы = ТаблицаПоступленийНаДату.НайтиСтроки(Отбор);
		
		Если СтрокиТаблицы.Количество() Тогда
			
			НоваяСтрока.Доступно = СтрокиТаблицы[0].ДоступноНаДату / Коэффициент; 
			
		Иначе
			
			НоваяСтрока.Доступно = 0;
			
		КонецЕсли;
	
		Если Выборка.Период < НачалоДня(ТекущаяДата()) Тогда 
			
			НоваяСтрока.Период = НачалоДня(ТекущаяДата()); 
			
		КонецЕсли;
		//-- #Б-1022 смарт: Мосолов 30.10.2024 
		#КонецВставки
		
		ПланируемыеОстатки.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	// Текущие остатки.
	Выборка = Результат[СоставРазделовЗапроса.Найти("ДоступныеТовары")].Выбрать();
	ТекущиеОстатки = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		#Удаление
		НоваяСтрока = Новый Структура("Склад, ВНаличии, Свободно");
		#КонецУдаления
		#Вставка
        //++ смарт:Подкин #1099 18.07.2022 15:31:07
        //НоваяСтрока = Новый Структура("Склад, ВНаличии, Свободно);
        НоваяСтрока = Новый Структура("Склад, ВНаличии, Свободно, Резерв, РезервОплачен");
        //-- смарт:Подкин #1099 18.07.2022 15:31:07
		#КонецВставки
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		
		НоваяСтрока.ВНаличии = НоваяСтрока.ВНаличии / Коэффициент;
		НоваяСтрока.Свободно = НоваяСтрока.Свободно / Коэффициент;
		
		ТекущиеОстатки.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Новый Структура("ТекущиеОстатки, ПланируемыеОстатки, Цена", ТекущиеОстатки, ПланируемыеОстатки, ЦенаПродажи);
	
КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

Функция смарт_ЦенаПродажиИОстаткиТовараНовая(Номенклатура, Характеристика, Соглашение, Валюта, Склады, ВидыЦен, смартЗапчастиГарантийные = Ложь) Экспорт
	
	Перем СоставРазделовЗапроса;
	
	Запрос = Новый Запрос;
	ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ИспользованиеХарактеристик");
	НесколькоХарактеристик = ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;

	Запрос.Текст = ОбеспечениеСервер.ТекстЗапросаДоступныхОстатковПоДатамДляПодбора(
		ЗначениеЗаполнено(Характеристика), НесколькоХарактеристик, СоставРазделовЗапроса)
		+ ПодборТоваровСервер.РазделительПакетаЗапросов()
		+ ПодборТоваровСервер.ТекстЗапросаЦенаПродажиТовара(СоставРазделовЗапроса);
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{(Номенклатура)}", "И Номенклатура = &Номенклатура И Характеристика = &Характеристика");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{(Номенклатура)}", "И Номенклатура = &Номенклатура");
		Характеристика =  Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("ВидыЦен", ВидыЦен);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДатаСеанса()));
	
	УстановитьПривилегированныйРежим(Истина);
	
    //++ смарт:Подкин #1099 18.07.2022 15:23:10  
    //Добавление в запрос вывода доп колонки Резерв
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"- Т.ВРезервеПодЗаказ КАК Свободно","- Т.ВРезервеПодЗаказ КАК Свободно,
    | Т.ВРезервеСоСклада+ Т.ВРезервеПодЗаказ КАК Резерв");
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"Т.Количество          КАК Свободно","Т.Количество          КАК Свободно,
    | 0 КАК Резерв");
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"СУММА(Свободно)       КАК Свободно","СУММА(Свободно)       КАК Свободно,
    | СУММА(Резерв)       КАК Резерв");   
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"Т.ВНаличииВБазовыхЕдиницах КАК ВНаличииВБазовыхЕдиницах,","Т.ВНаличииВБазовыхЕдиницах КАК ВНаличииВБазовыхЕдиницах,
    | 0 КАК РезервОплачен,");
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"0                     КАК ВНаличииВБазовыхЕдиницах,","0                     КАК ВНаличииВБазовыхЕдиницах,
    | 0 КАК РезервОплачен,");
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"И Т.Номенклатура = &Номенклатура) КАК Т", "И Т.Номенклатура = &Номенклатура
    |
    | ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ТоварыКОтгрузкеОстатки.Склад,
    |	ТоварыКОтгрузкеОстатки.Склад.Наименование,
    |	0,
    |	0,
    |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0),
    |	NULL,
    |	0
    |ИЗ
    |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
    |			,
    |			Номенклатура = &Номенклатура
    |				И Склад в (&Склады)) КАК ТоварыКОтгрузкеОстатки
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
    |		ПО ТоварыКОтгрузкеОстатки.ДокументОтгрузки = СостоянияЗаказовКлиентов.Заказ
    |			ГДЕ (СостоянияЗаказовКлиентов.СуммаОплаты > 0) ) КАК Т");  
    
    Запрос.Текст=СтрЗаменить(Запрос.Текст,"СУММА(Т.ВНаличииВБазовыхЕдиницах) КАК ВНаличииВБазовыхЕдиницах,","СУММА(Т.ВНаличииВБазовыхЕдиницах) КАК ВНаличииВБазовыхЕдиницах,
    | СУММА(Т.РезервОплачен) КАК РезервОплачен,
    |"); 
    
    //++ #1964 смарт: Лопато 17.09.2024 //Корректное отображения остатков товаров в помощнике по продажам, при подборе товаров  
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Т.Дата >= ПредыдущиеДни.Дата",
    										 "И Т.Дата >= ПредыдущиеДни.Дата
    										 |И Т.Характеристика = ПредыдущиеДни.Характеристика");

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "- ОстаткиСклада.ВРезервеПодЗаказ, 0)) КАК Доступно",
    									 	 "- ОстаткиСклада.ВРезервеПодЗаказ, 0)) КАК Доступно,
    										 |	СУММА(ЕСТЬNULL(ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток, 0)) КАК Резерв");    
    //-- #1964 смарт: Лопато 17.09.2024  
	
	//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"СУММА(ЕСТЬNULL(ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток, 0)) КАК Резерв",
		"СУММА(ЕСТЬNULL(ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток, 0)) КАК Резерв,
		|	СУММА(Т.Количество) КАК ДоступноНаДату");
	//-- #Б-1022 смарт: Мосолов 30.10.2024 

	Если СтрНайти(Запрос.Текст,"ВтПриростДоступностиПоХарактеристике") Тогда
        Запрос.Текст=СтрЗаменить(Запрос.Текст," И Т.Характеристика = ОстаткиСклада.Характеристика",
        " И Т.Характеристика = ОстаткиСклада.Характеристика 
        |ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(
        |		,
        |		Склад В (&Склады)
        |			И Номенклатура = &Номенклатура) КАК ГрафикОтгрузкиТоваровОстатки
        |ПО (Т.Склад = ГрафикОтгрузкиТоваровОстатки.Склад)
        |	И (Т.Характеристика = ГрафикОтгрузкиТоваровОстатки.Характеристика)
        |	И (Т.Дата = ГрафикОтгрузкиТоваровОстатки.ДатаОтгрузки)");    
    Иначе   
        Запрос.Текст=СтрЗаменить(Запрос.Текст," И Т.Характеристика = ОстаткиСклада.Характеристика",
        " И Т.Характеристика = ОстаткиСклада.Характеристика 
        |ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(
        |		,
        |		Склад В (&Склады)
        |			И Номенклатура = &Номенклатура) КАК ГрафикОтгрузкиТоваровОстатки
        |ПО (Т.Склад = ГрафикОтгрузкиТоваровОстатки.Склад)
        |	И (Т.Характеристика = ГрафикОтгрузкиТоваровОстатки.Характеристика)
        |	И (Т.ДатаДоступности = ГрафикОтгрузкиТоваровОстатки.ДатаОтгрузки)");    
    КонецЕсли;
    //-- смарт:Подкин #1099 18.07.2022 15:23:10
	
	//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
	Если смартЗапчастиГарантийные Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Т.ВНаличииОстаток", "Т.смартВНаличииГарантийныеОстаток");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Т.ВРезервеСоСкладаОстаток", "Т.смартВРезервеСоСкладаГарантийныеОстаток");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Т.ВРезервеПодЗаказОстаток", "Т.смартВРезервеПодЗаказГарантийныеОстаток");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Т.Количество", "Т.смартКоличествоГарантийные");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0)", "ЕСТЬNULL(ТоварыКОтгрузкеОстатки.смартВРезервеГарантийныеОстаток, 0)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаНаДаты.Количество", "ТаблицаНаДаты.смартКоличествоГарантийные");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредыдущиеДни.Количество", "ПредыдущиеДни.смартКоличествоГарантийные");
		
	КонецЕсли;
	//-- #Б1480 смарт: Шляпников 03.12.2024
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Цена продажи.
	Коэффициент = 1;
	
	ЦенаПродажи = Новый Структура("ВидЦены, Цена, Упаковка, ЕдиницаИзмерения, Описание, СрокПоставки");
	
	ЦенаПродажи.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	ЦенаПродажи.Цена = 0;
	ЦенаПродажи.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ЦенаПродажи.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ЦенаПродажи.Описание = "";
	ЦенаПродажи.СрокПоставки = '00010101';
	
	Выборка = Результат[СоставРазделовЗапроса.Найти("ЦенаПродажиТовара")].Выбрать();
	Если Выборка.Следующий() Тогда
		
		Коэффициент = Выборка.Коэффициент;
		ЗаполнитьЗначенияСвойств(ЦенаПродажи, Выборка);
		
	КонецЕсли;
	
	// Планируемые остатки.
	Выборка = Результат[СоставРазделовЗапроса.Найти("ПланируемыеОстатки")].Выбрать();
	ПланируемыеОстатки = Новый Массив;
	
	//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками
	ТаблицаПоступленийНаДату = Результат[СоставРазделовЗапроса.Найти("ПланируемыеОстаткиНаДату")].Выгрузить(); 
	//-- #Б-1022 смарт: Мосолов 30.10.2024 

	Пока Выборка.Следующий() Цикл    
		
        //++ смарт:Подкин #1099 24.07.2022 14:49:10
		//НоваяСтрока = Новый Структура("Склад, Период, Доступно"); 
        НоваяСтрока = Новый Структура("Склад, Период, Доступно, Резерв, РезервОплачен"); 
        //-- смарт:Подкин #1099 24.07.2022 14:49:10
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		
		//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками 
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Склад", Выборка.Склад); 
		
		СтрокиТаблицы = ТаблицаПоступленийНаДату.НайтиСтроки(Отбор);
		
		Если СтрокиТаблицы.Количество() Тогда
			
			НоваяСтрока.Доступно = СтрокиТаблицы[0].ДоступноНаДату / Коэффициент; 
			
		Иначе
			
			НоваяСтрока.Доступно = 0;
			
		КонецЕсли;
	
		Если Выборка.Период < НачалоДня(ТекущаяДата()) Тогда 
			
			НоваяСтрока.Период = НачалоДня(ТекущаяДата()); 
			
		КонецЕсли;
		//-- #Б-1022 смарт: Мосолов 30.10.2024 
		
		ПланируемыеОстатки.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	// Текущие остатки.
	Выборка = Результат[СоставРазделовЗапроса.Найти("ДоступныеТовары")].Выбрать();
	ТекущиеОстатки = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
        //++ смарт:Подкин #1099 18.07.2022 15:31:07
        //НоваяСтрока = Новый Структура("Склад, ВНаличии, Свободно);
        НоваяСтрока = Новый Структура("Склад, ВНаличии, Свободно, Резерв, РезервОплачен");
        //-- смарт:Подкин #1099 18.07.2022 15:31:07
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		
		НоваяСтрока.ВНаличии = НоваяСтрока.ВНаличии / Коэффициент;
		НоваяСтрока.Свободно = НоваяСтрока.Свободно / Коэффициент;
		
		ТекущиеОстатки.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Новый Структура("ТекущиеОстатки, ПланируемыеОстатки, Цена", ТекущиеОстатки, ПланируемыеОстатки, ЦенаПродажи);
	
КонецФункции


#КонецОбласти
